//ECMAScript : JavaScript의 표준
//ECMA : 국제 표준화 기구
/**
 * Modern JavaScript 
 * 현 시점에 사용하기 적합한 범위 내에서
 * 최신 버전의 표준을 준수하는 자바스크립트
 * 
 * 자바스크립트는 다른 언어에 비해서 데이터 타입이 굉장히 유연하다.
 * 
 * Symbol, BigInt가 추가됌 
 * Symbol은 유일한 값
 * BigInt는 엄청 큰 숫자를 다룰 때
 * 
 * 불린 타입이 필요한 맥락에서는 불린이 아닌 타입도 불린 타입으로 형변환 된다.
 * false로 평가되는 값(Falsy) : false, null, undefined, NaN, 0, ''
 * true로 평가되는 값(Truthy) : 나머지 값들 (빈 객체나 빈 배열도 Truthy)
 * 
 * 자바스크립트의 AND와 OR
 * 
 * 자바스크립트의 AND 연산자는 왼쪽 값이 true라면 오른 쪽 값을 리턴
 * 왼쪽 값이 false라면 왼쪽 값을 리턴 
 * 
 * 자바스크립트의 OR 연산자는 왼쪽 값이 왼쪽 값을 리턴 
 * 왼쪽 값이 false라면 오른 쪽 값을 리턴
 * 
 * 함수 안에 함수를 선언하면 함수 바깥에서 호출할 수 없지만
 * 함수가 아닌 코드 블럭 안에 함수를 선언하면 전역함수가 된다. 
 * 
 * 함수 선언식으로 선언되면 함수 선언 순서와 상관없이 호출될 수 있다. ex)var 
 * 함수 표현식은 함수 선언 이후에 호출할 수 있다는 점이 있다. 
 * 
 */